# BASE
base-devel
git

# SHELL / TERMINAL
fish
bash-completion

# CLI TOOLS
btop
ncdu
dust
duf
tree
fastfetch
eza
starship
curl
wget
jq
rsync
bc
ripgrep
go-yq
unzip
zip
p7zip

# DESENVOLVIMENTO
nano
neovim
cmake
ninja
github-cli
git-lfs
git-filter-repo
gitleaks
nodejs
npm
pnpm
dotnet-sdk
docker
docker-compose
lazydocker
postgresql

# PYTHON
python
python-pip
uv
clang

# FONTES (opcional, só se usar terminal com rendering de fonte)
ttf-jetbrains-mono-nerd
ttf-nerd-fonts-symbols